# # Джерело
#
# Переклав *Бабенко В.П.* методист цетнру STEAM-освіти
#
# Весь метаріал взятий з курсу "Поколение Python: курс для начинающих", який розташований на платформі [stepik.org](https://stepik.org/) і знаходиться у вільному доступі за [посиланням](https://stepik.org/course/58852/info).
#
# Цей курс знайомить школярів та всіх, кому це цікаво, з програмуванням.
#
# Розповідає про основні типи даних, конструкції та принципи структурного програмування, використовуючи версію мови Python 3.x.
#
# Вибрано Python за ясність коду та швидкість реалізації на ньому програм.
#
# Мета курсу – формування базових понять структурного програмування.
#
# У ньому 8 модулів з теоретичними та практичними матеріалами та завданнями.
#
# **Модулі курсу:**
#
# 1. Введення-виведення даних
# 2. Умовний оператор
# 3. Типи даних
# 4. Цикли for та while
# 5. Рядковий тип даних
# 6. Списки
# 7. Функції
# 8. Робота над міні-проектом
#
# Рішення перевіряє автоматична система, тому зворотний зв'язок ви отримаєте швидко. Якщо у вас виникнуть питання, команда курсу дасть поради та підказки. Крім того, проблеми можна обговорювати з однокурсниками у коментарях до завдань.
#
# Курс – переможець конкурсу Stepik Awards 2020 у номінації "Найкращий безкоштовний онлайн-курс розміщений на платформі Stepik".
#
# Викладачі:
#
# * Тимур Гуєв<br>
# Засновник та викладач онлайн-школи BEEGEEK.
#
# * Руслан Чанієв<br>
# Адміністратор онлайн-школи BEEGEEK
#
# * Анрі Табуєв<br>
# Адміністратор онлайн-школи BEEGEEK
#
# [reverso](https://www.reverso.net/)
#
# [exploring best syntax highlighting libraries](https://blog.logrocket.com/exploring-best-syntax-highlighting-libraries/)